       01 RECORD-R.
           05 NINE-NUMBER 99.
           05 ONE-NINE-NUMBER 9.
           05 TWO-NINE-NUMBER 9(2).
           05 ALPHA aaa.
           05 ALPHA-PAREN a(3).
           05 ALPHA-NUM xxxx.
           05 ALPHA-NUM-PAREN x(4).
           05 DECIMAL v(3). *> can store .175
           05 SIGNED-NUM s9(2). *> examples -76
           05 ASSUMED-DECIMAL p9. *> .6
           05 PICTURE-ALPHA PIC X(10).
           05 PICTURE-CHAR PIC X.
           05 PICTURE-NUM PIC 9(2).
           05 PIC-NUM-COMP PIC 9(2) COMP.
           05 PIC-NUM-COMP-3 PIC 9(2) COMP-3.
           05 PIC-DECIMAL PIC 9(6)V9(2).